model {
  ssd {
    num_classes: 2
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "ssd_inception_v2"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 3.9999998989515007e-05
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.029999999329447746
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.9997000098228455
          center: true
          scale: true
          epsilon: 0.0010000000474974513
          train: true
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.9999998989515007e-05
            }
          }
          initializer {
            truncated_normal_initializer {
              mean: 0.0
              stddev: 0.029999999329447746
            }
          }
          activation: RELU_6
        }
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.800000011920929
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.20000000298023224
        max_scale: 0.949999988079071
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.33329999446868896
        reduce_boxes_in_lowest_layer: true
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.30000001192092896
        iou_threshold: 0.6000000238418579
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid {
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.9900000095367432
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 0
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
  }
}
train_config {
  batch_size: 16
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  optimizer {
    momentum_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.003000000026077032
          schedule {
            step: 600
            learning_rate: 0.0024999999441206455
          }
          schedule {
            step: 1200
            learning_rate: 0.0020000000949949026
          }
          schedule {
            step: 1800
            learning_rate: 0.001500000013038516
          }
          schedule {
            step: 2400
            learning_rate: 0.0020000000949949026
          }
          schedule {
            step: 3000
            learning_rate: 0.0024999999441206455
          }
          schedule {
            step: 3600
            learning_rate: 0.003000000026077032
          }
          schedule {
            step: 4200
            learning_rate: 0.0024999999441206455
          }
          schedule {
            step: 4800
            learning_rate: 0.0020000000949949026
          }
          schedule {
            step: 5400
            learning_rate: 0.001500000013038516
          }
          schedule {
            step: 6000
            learning_rate: 0.0020000000949949026
          }
          schedule {
            step: 6600
            learning_rate: 0.0024999999441206455
          }
          schedule {
            step: 7200
            learning_rate: 0.003000000026077032
          }
          schedule {
            step: 7800
            learning_rate: 0.0024999999441206455
          }
          schedule {
            step: 8400
            learning_rate: 0.0020000000949949026
          }
          schedule {
            step: 9000
            learning_rate: 0.001500000013038516
          }
          schedule {
            step: 9600
            learning_rate: 0.0010000000474974513
          }
          schedule {
            step: 10200
            learning_rate: 0.0007999999797903001
          }
          schedule {
            step: 10800
            learning_rate: 0.0006000000284984708
          }
          schedule {
            step: 11400
            learning_rate: 0.00039999998989515007
          }
          schedule {
            step: 12000
            learning_rate: 0.0006000000284984708
          }
          schedule {
            step: 12600
            learning_rate: 0.0007999999797903001
          }
          schedule {
            step: 13200
            learning_rate: 0.0010000000474974513
          }
          schedule {
            step: 13800
            learning_rate: 0.0007999999797903001
          }
          schedule {
            step: 14400
            learning_rate: 0.0006000000284984708
          }
          schedule {
            step: 15000
            learning_rate: 0.00039999998989515007
          }
          schedule {
            step: 15600
            learning_rate: 0.0005000000237487257
          }
          schedule {
            step: 16200
            learning_rate: 0.0006000000284984708
          }
          schedule {
            step: 16800
            learning_rate: 0.0005000000237487257
          }
          schedule {
            step: 17400
            learning_rate: 0.00039999998989515007
          }
        }
      }
      momentum_optimizer_value: 0.8999999761581421
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "pre-trained models/ssd_inception_v2_coco_2018_01_28/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 25000
}
train_input_reader {
  label_map_path: "/content/occlusion_experiments/main_content/data/main_data/pistol_car_label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/content/occlusion_experiments/main_content/data/main_data/train.record"
  }
}
eval_config {
  num_visualizations: 350
  num_examples: 350
  max_evals: 10
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "/content/occlusion_experiments/main_content/main/pistol_car_label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  num_readers: 1
  tf_record_input_reader {
    input_path: "/content/occlusion_experiments/main_content/data/main_data/test.record"
  }
  sample_1_of_n_examples: 1
}
